Revit 2027 API
CurveLoop.GetCurveLoopIterator Method
 Returns a curve that iterates through the curve loop.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CurveLoopIterator GetCurveLoopIterator()
Public Function GetCurveLoopIterator As CurveLoopIterator
public:
CurveLoopIterator^ GetCurveLoopIterator()
member GetCurveLoopIterator : unit -> CurveLoopIterator
Return Value
CurveLoopIterator
 A curve loop iterator object that can be used to iterate through key-value pairs in the collection.
See Also
Reference
CurveLoop Class
Autodesk.Revit.DB Namespace